app/controllers/member_controller.rb

SELECT `signups`.* FROM `signups`
---
  def signup
    @signups = Signup.all.reverse

INSERT INTO `signups` (`userid`, `password_digest`, `company`, `tel`, `email`, `created_at`, `updated_at`) VALUES ('test', '$2a$10$r2LtTWv8VAbX6NKriffUjeRG2r7c5KdM./rLjKt8.i/m6EnVfplOe', '합이', '010-0000-0000', 'test@test', '2019-04-15 09:18:29', '2019-04-15 09:18:29')
---
  def create
    @member = Signup.new
    @member.userid = params[:userid]
    @member.password = params[:password]
    @member.company = params[:company]
    @member.tel = params[:tel]
    @member.email = params[:email]
    @member.save