app/controllers/session_controller.rb

  def create
    user = Signup.find_by(tel: params[:tel])
---
SELECT  `signups`.* FROM `signups` WHERE `signups`.`tel` = '010-0000-0000' LIMIT 1